{
	"title": "Books and Book Chapters",
	"content": "<ol> <li>A. Inci, M.M. Isgenc, and D. Marculescu, “Efficient Deep Learning Using Non-Volatile Memory Technology,” in Embedded Machine Learning for Cyber-Physical, IoT, and Edge Computing, Sudeep Pasricha and Muhammad Shafique (eds.), Springer Nature, 2022.\n</li> <li>D. Marculescu, “The Quest for Energy Aware Computing: Confessions of an Accidental Engineer,” in Women Engineers in the Golden Age of Microelectronics, Alice Cline Parker and Leda Lunardi (eds.), Springer Nature, 2020.</li> <li>K. Bharadwaj, R. Ding, D. Stamoulis, R. Marculescu, and D. Marculescu, “Computational Approaches for Incorporating Short and Long Term Dynamics in Smart Water Networks,” in Smart Water Grids: A Cyber-Physical Approach, P. Tsakalides, A. Panousopoulou, G. Tsagkatakis, L. Montestruque (eds.), Taylor and Francis, 2018.</li><li>S. Garg, Y. Turakhia, and D. Marculescu, “Heterogeneous Dark Silicon Chip Multi-Processors: Design and Run-time Management,” in The Dark Side of Silicon (Computing in the Dark Silicon Era), A. Jantsch and A. Rahmani (eds.), Springer Verlag, 2016.</li><li>S. Garg, D. Marculescu, and R. Marculescu, “Fundamental Limits on Run-time Power Management Algorithms for MPSoCs,” in Sustainable and Green Computing Systems, P. Pande (ed.), Springer Verlag, 2013.</li><li>S. Herbert and D. Marculescu, “Variability-Aware Frequency Scaling in Multi-Clock Processors,” in Adaptive and Dynamic Techniques for Processor Optimization: Theory and Practice, A. Wang and S. Naffzinger (eds.), Springer Verlag, 2008.</li><li>E. Talpes and D. Marculescu, “Low power microarchitecture techniques,” in The VLSI Handbook, W.-K. Chen (ed.), CRC Book Press, 2006.</li><li>P. Stanley-Marbell, D. Marculescu, R. Marculescu, and P.K. Khosla, “Challenges and Opportunities in Modeling, Analysis and Optimization of Electronic Textiles,” in Low Power Electronics Design, C. Piguet (ed.), CRC Book Press, 2004.</li><li>P. Stanley-Marbell, N.H. Zamora, D. Marculescu, and R. Marculescu, “Fault-tolerant techniques for ambient intelligent distributed systems,” in Ambient Intelligence: Impact on embedded-system design, T. Basten, M. Geilen, H. de Groot (eds.), Kluwer Academic Publishers, 2003.</li><li>V.S.P. Rapaka and D. Marculescu, “Efficient power/performance analysis of embedded and general purpose software applications,” in Embedded Software for SoC, A. Jerraya, S. Yoo, N. Wehn, D. Verkest (eds.), Kluwer Academic Publishers, 2003.</li><li>S.W. Haga, N. Reeves, R. Barua, and D. Marculescu, “Dynamic functional units assignment for low power,” in Embedded Software for SoC, A. Jerraya, S. Yoo, N. Wehn, D. Verkest (eds.), Kluwer Academic Publishers, 2003.</li><li>D. Marculescu and R. Marculescu, “System and microarchitectural level power modeling, optimization, and their implications in energy aware computing,” in Power Aware Design Methodologies, M. Pedram, J. Rabaey (eds.), Kluwer Academic Publishers, 2002.</li><li>I. Athanasiu, D. (Raiciu) Marculescu, R. Sion, and I. Mocanu, “Formal Languages – Applications,” Computer Science Department, “Politehnica” University of Bucharest Press, December 1999.</li></ol>"
}