{
    "title": "Conferences, Symposia and Workshop Papers",
	"content": "<ol> <li>HY. Chiang and D. Marculescu, “SCAN-Edge: Finding MobileNet-speed Hybrid Networks for Commodity Edge Devices”, 5th Workshop on practical ML for limited/low resource settings, International Conference on Learning Representations (ICLR), 2024</li> <li>F. Liang, B. Wu, J. Wang, L. Yu, K. Li, Y. Zhao, I. Misra, J. Huang, P. Zhang, P. Vajda, D. Marculescu, “Flowvid: Taming Imperfect Optical Flows for Consistent Video-to-Video Synthesis,” in Proc. IEEE Conference on Computer Vision and Pattern Recognition (CVPR), Seattle, WA, June 2024.</li> <li>T. Mahmud, C.-H. Liu, B. Yaman, and D. Marculescu, “SSVOD: Semi-Supervised Video Object Detection with Sparse Annotations”, in Proc. IEEE Winter Conference on Applications of Computer Vision (WACV), Waikoloa, HI, Jan. 2024</li> <li>C.-C. Chang, Y.-Y. Sung, S. Yu, N.-C. Huang, D. Marculescu, and K.-C. Wu, “FLORA: Fine-grained Low-Rank Architecture Search for Vision Transformer,” in Proc. IEEE Winter Conference on Applications of Computer Vision (WACV), Waikoloa, HI, Jan. 2024</li> <li>E. Taka, A. Arora, K.-C. Wu and D. Marculescu, “MaxEVA: Maximizing the Efficiency of Matrix Multiplication on Versal AI Engine,” in Proc. IEEE International Conference on Field Programmable Technology (FPT), Yokohama, Japan, Dec. 2023</li> <li>N. Frumkin, D. Gope, and D. Marculescu, “Jumping through Local Minima: Quantization in the Loss Landscape of Vision Transformers,” in Proc. IEEE International Conference on Computer Vision (ICCV), Paris, France, September 2023.</li> <li>F. Liang, B. Wu, X. Dai, K. Li, Y. Zhao, H. Zhang, P. Zhang, P. Vajda, and D. Marculescu, “Open-Vocabulary Semantic Segmentation with Mask-adapted CLIP,” in Proc. IEEE Conference on Computer Vision and Pattern Recognition (CVPR), Vancouver, Canada, June 2023.</li> <li>\tT. Mahmud, F. Liang, Y. Qing, and D. Marculescu, “Clip4VideoCap: Rethinking CLIP for Video Captioning with Multiscale Temporal Fusion and Commonsense Knowledge,” in Proc. IEEE International Conference on Acoustics, Speech and Signal Processing (ICASSP), Rhodes Island, Greece, June 2023.</li> <li>HY. Chiang, N. Frumkin, F. Liang, and D. Marculescu, “MobileTL: On-device Transfer Learning with Inverted Residual Blocks”, Association for the Advancement of Artificial Intelligence (AAAI), 2023</li> <li> T. Mahmud, and D. Marculescu, “AVE-CLIP: AudioCLIP-based Multi-window Temporal Transformer for Audio Visual Event Localization”, in Proc. IEEE/CVF Winter Conference on Applications of Computer Vision (WACV), Waikoloa, Hawaii, January 2023 </li> <li>HY. Chiang, N. Frumkin, F. Liang, and D. Marculescu, “MobileTL: On-device Transfer Learning with Inverted Residual Blocks”, Hardware Aware Efficient Training Worksop, International Conference on Machine Learning (ICML), 2022</li> <li>T. Mahmud, N. Frumkin, and D. Marculescu, “Reinforcement Learning Assisted Layer-wise Fine-Tuning for Transfer Learning”, Pre-training: Perspectives, Pitfalls, and Paths Forward Workshop, International Conference on Machine Learning (ICML), 2022</li> <li>Y. Zhou, F. Liang, T.-W. Chin, and D. Marculescu, “Play It Cool: Dynamic Network Prevents Thermal Throttling”, Workshop on Dynamic Neural Networks, International Conference on Machine Learning (ICML), 2022</li> <li>F. Liang, T.-W. Chin, Y. Zhang, and D. Marculescu, “ANT: Adapt Network Across Time for Efficient Video Processing,” in Proc. of Intl. Conference on Computer Vision and Pattern Recognition Workshops (CVPRW), Efficient Deep Learning for Computer Vision Workshop, New Orleans, LA, June 2022. </li><li> T.-W. Chin, A. S. Morcos, and D. Marculescu, “Joslim: Joint Widths and Weights Optimization for Slimmable Neural Networks,” in Proc. European Conference on Machine Learning and Principles and Practice of Knowledge Discovery in Databases (ECML-PKDD), Virtual, Sept. 2021</li><li>A. Inci, S. G. Virupaksha, A. Jain, V. Thallam, R. Ding, and D. Marculescu, “QADAM: Quantization-Aware DNN Accelerator Modeling for Pareto-Optimality,” ML for Computer Architecture and Systems (MLArchSys), 2021</li><li>T.-W. Chin, C. Zhang, and D. Marculescu, “Renofeation: A Simple Transfer Learning Method for Improved Adversarial Robustness,” in Proc. IEEE Conference on Computer Vision and Pattern Recognition Workshops (CVPRW), Virtual, June 2021.</li><li>T.-W. Chin, D. Marculescu, and A. S. Morcos, “Width transfer: on the (in)variance of width optimization,” in Proc. IEEE Conference on Computer Vision and Pattern Recognition Workshops (CVPRW), Virtual, June 2021.</li><li>A. Inci, S. G. Virupaksha, A. Jain, V. V. Thallam, R. Ding, and D. Marculescu, “QAPPA: Quantization-Aware Power, Performance, and Area Modeling of DNN Accelerators,” 2nd On-Device Intelligence Workshop, MLSys'21</li><li>A. Inci, M. M. Isgenc, and D. Marculescu, “Cross-Layer Design Space Exploration of NVM-based Caches for Deep Learning,” 12th Non-Volatile Memories Workshop (NVMW) 2021</li><li>T.-W. Chin, P. Chuang, V. Chandra, and D. Marculescu, “One Weight Bitwidth to Rule Them All,” in Proc. European Conference on Computer Vision Workshops (ECCVW), Glasgow, UK, August 2020.</li> <li>T.-W. Chin, R. Ding, C. Zhang, and D. Marculescu, “Towards Efficient Model Compression via Learned Global Ranking,” in Proc. IEEE Conference on Computer Vision and Pattern Recognition (CVPR), Seattle, WA, June 2020.</li> <li>Z. Chen, J. Zhang, R. Ding, and D. Marculescu, “ViP: Virtual Pooling for Accelerating CNN-based Image Classification and Object Detection,” in Proc. IEEE Winter Conference on Applications of Computer Vision (WACV), Aspen, CO, March 2020.</li> <li>A. Inci, M.M. Isgenc, D. Marculescu, “DeepNVM: A Framework for Modeling and Analysis of Non-Volatile Memory Technologies for Deep Learning Applications,” in Proc. IEEE/ACM Design, Automation, and Test in Europe Conference (DATE), Grenoble, France, March 2020.</li> <li>D. Stamoulis, R. Ding, D. Wang, D. Lymberopoulos, B. Priyantha, J. Liu, D. Marculescu, “Single-Path NAS: Designing Hardware-Efficient ConvNets in less than 4 Hours,” in Proc. European Conference on Machine Learning and Principles and Practice of Knowledge Discovery in Databases (ECML-PKDD), Wurzburg, Germany, Sept. 2019.</li> <li> R. Ding, T.-W. Chin, D. Marculescu, and Z. Liu, “Regularizing Activation Distribution for Training Binarized Deep Networks,” in Proc. IEEE Conference on Computer Vision and Pattern Recognition (CVPR), Long Beach, CA, June 2019. </li> <li> R. Ding, Z. Liu, T.-W. Chin, D. Marculescu, and S. Blanton, “Lightweight Quantized Deep Neural Networks for Fast and Accurate Inference,” in Proc. ACM/IEEE Design Automation Conference (DAC), Las Vegas, June 2019. </li><li> T.-W. Chin, C. Zhang, D. Marculescu, “Layer-compensated Pruning for Resource-constrained Convolutional Neural Networks,” in 2nd Workshop on Machine Learning on the Phone and other Consumer Devices (MLPCD 2) in conjunction with the Conference on Neural Information Processing Systems (NeurIPS), Dec. 2018. </li> <li> R. Ding, Z. Liu, T.-W. Chin, D. Marculescu, S. Blanton, “Differentiable Training for Hardware Efficient LightNNs,” in Workshop on Compact Deep Neural Networks with Industrial Applications (CDNNIA) in conjunction with the Conference on Neural Information Processing Systems (NeurIPS), Dec. 2018. </li><li> Z. Chen, R. Ding, T.-W. Chin, and D. Marculescu, “Understanding the Impact of Label Granularity on CNN-based Image Classification,” in Proc. IEEE International Workshop on Data Science and Big Data Analytics (DSDA) in conjunction with IEEE International Conference on Data Mining (ICDM), Singapore, Nov. 2018. </li> <li> D. Stamoulis, T.-W. Chin, A. K. Prakash, H. Fang, S. Sajja, M. Bognar, and D. Marculescu, “Designing Adaptive Neural Networks for Energy-Constrained Image Classification,” in Proc.  IEEE/ACM Intl. Conference on Computer-Aided Design (ICCAD), San Diego, CA, Nov. 2018. </li> <li> B.K. Joardar, J.R. Doppa, P.P. Pande, D. Marculescu, and R. Marculescu, “Hybrid On-Chip Communication Architectures for Heterogeneous Manycore System,” in Proc. IEEE/ACM Intl. Conference on Computer-Aided Design (ICCAD), San Diego, CA, Nov. 2018. <b>(Special session)</b> </li> <li> D. Marculescu, D. Stamoulis, and E. Cai, “Hardware‐Aware Machine Learning: Modeling and Optimization,” in Proc. IEEE/ACM Intl. Conference on Computer-Aided Design (ICCAD), San Diego, CA, Nov. 2018. <b>(Special session)</b> </li> <li>D. Stamoulis, E. Cai, D. C. Juan, and D. Marculescu, “HyperPower: Power- and Memory-Constrained Hyper-Parameter Optimization for Neural Networks,” in Proc. IEEE/ACM Design, Automation, and Test in Europe Conference (DATE), Dresden, Germany, March 2018.</li><li>E. Cai, D.-C. Juan, D. Stamoulis, and D. Marculescu, “NeuralPower: Predict and Deploy Energy-Efficient Convolutional Neural Networks,” in Proc. Asian Conference on Machine Learning (ACML), Seoul, Korea, Nov. 2017. https://arxiv.org/abs/1710.05420</li><li>R. Ding and D. Marculescu, “Leveraging Classification Models for River Forecasting,” in Proc. ACM SIGSPATIAL International Conference on Advances in Geographic Information Systems (SIGSPATIAL), Redondo Beach, CA, Nov. 2017.</li><li>B. Joardar, W. Choi, R. Kim, J.R. Doppa, P.P. Pande, D. Marculescu, and R. Marculescu “3D NoC-Enabled Heterogeneous Manycore Architectures for Accelerating CNN Training: Performance and Thermal Trade-offs,” in Proc. IEEE/ACM International Symposium on Networks on Chip (NOCS), Seoul, South Korea, Oct. 2017.</li><li>D.-C. Juan, N. Shah, Z. Qian, M. Tang, D. Marculescu, and C. Faloutsos “M3A: Model, MetaModel, and Anomaly Detection for Inter-arrivals of Web Searches and Postings,” in Proc. IEEE International Conference on Data Science and Advanced Analytics (DSAA), Tokyo, Japan, Oct. 2017.</li><li>R. Ding, Z. Liu, R. Shi, D. Marculescu, and S. Blanton, “LightNN: Filling the Gap between Conventional Deep Neural Networks and Binarized Networks,” in Proc. ACM Great Lakes Symposium on VLSI (GLSVLSI), Banff, Canada, May 2017 (<b>Best Paper Award</b>).</li><li>R. Ding, D. Stamoulis, K. Bhardwaj, D. Marculescu, and R. Marculescu “Enhancing Precipitation Models by Capturing Multivariate and Multiscale Climate Dynamics,” in Proc. IEEE Intl. Workshop on Cyber-Physical Systems for Smart Water Networks (CysWater), Pittsburgh, PA, May 2017.</li><li>E. Cai, D. Stamoulis, and D. Marculescu, “Exploring Aging Deceleration in FinFET-Based Multi-Core Systems,” in Proc. of the IEEE/ACM Intl. Conference on Computer-Aided Design (ICCAD), Austin, TX, Nov. 2016.</li><li>W. Choi, K. Duraisamy, R. Kim, J.R. Doppa, P. Pande, R. Marculescu, and D. Marculescu, “Hybrid Network-on-Chip Architectures for Accelerating Deep Learning Kernels on Heterogeneous Manycore Platforms,” in Proc. IEEE/ACM International Conference on Compilers, Architectures and Synthesis of Embedded Systems (CASES), Pittsburgh, PA, Oct. 2016.</li><li>D. Stamoulis and D. Marculescu, “Can We Guarantee Performance Requirements under Workload and Process Variations?” in Proc. of ACM/IEEE Intl. Symposium on Low Power Electronics and Design (ISLPED), San Francisco, CA, Aug. 2016.</li><li>E. Cai and D. Marculescu, “TEI-Turbo: Temperature Effect Inversion-Aware Turbo Boost for FinFET-Based Multi-Core Systems,” in Proc. of the IEEE/ACM Intl. Conference on Computer-Aided Design (ICCAD), Austin, TX, Nov. 2015.</li><li>R.D. Blanton, X. Li, K. Mai, D. Marculescu, R. Marculescu, J. Paramesh, J. Schneider, and D.E. Thomas, “Statistical Learning in Chip (SLIC),” in Proc. of the IEEE/ACM Intl. Conference on Computer-Aided Design (ICCAD), Austin, TX, Nov. 2015. (<b>Invited paper</b>)</li><li>P. Pande, R. Kim, W. Choi, Z. Chen, D. Marculescu, and R. Marculescu, “The (Low) Power of Less Wiring: Enabling Energy Efficiency in Many-Core Platforms Through Wireless NoC,” Proc. of the IEEE/ACM Intl. Conference on Computer-Aided Design (ICCAD), Austin, TX, Nov. 2015. (<b>Invited paper</b>)</li><li>D. Marculescu, D-C. Juan, and G. Liu, “Understanding and Using Heterogeneity for High Performance, Energy Efficient Computing,” in Proc. IEEE Intl. Conference on Control Systems and Computer Science (CSCS), Bucharest, Romania, May 2015. (<b>Invited paper</b>)</li><li>K. Duraisamy, R. Kim, W. Choi, G. Liu, P. Pande, D. Marculescu, and R. Marculescu, “Energy Efficient MapReduce with VFI-enabled multicore Platforms,” in Proc. ACM/IEEE Design Automation Conference (DAC), San Francisco, CA, June 2015.</li><li>Z. Chen and D. Marculescu, “Distributed Reinforcement Learning for Power Limited Many-core System Performance Optimization,” in Proc. IEEE/ACM Design, Automation, and Test in Europe Conference (DATE), Grenoble, France, March 2015.</li><li>S. Blanton, X. Li, K. Mai, D. Marculescu, R. Marculescu, J. Paramesh, J. Schneider, and D. Thomas, “SLIC: Statistical Learning in Chip,” in Proc. IEEE International Symposium on Integrated Circuits (ISIC), Singapore, Dec. 2014. (<b>Special session</b>)</li><li>R. Kim, G. Liu, P. Wettin, R. Marculescu, D. Marculescu, and P. P. Pande, “Energy-Efficient VFI-Partitioned Multicore Design Using Wireless NoC Architectures,” in Proc. IEEE/ACM International Conference on Compilers, Architectures and Synthesis of Embedded Systems (CASES), New Delhi, India, Oct. 2014.</li><li>M. Shafique, S. Garg, D. Marculescu, and J. Henkel, “The EDA Challenges in the Dark Silicon Era,” in Proc. ACM/IEEE Design Automation Conference (DAC), San Francisco, CA, June 2014.</li><li>D.-C. Juan, L. Li, H.-K. Peng, D. Marculescu, and C. Faloutsos, “Beyond Poisson: Modeling Inter-Arrival Times of Requests in a Datacenter,” in Proc. Pacific-Asia Conference on Knowledge Discovery and Data Mining (PAKDD), Tainan, Taiwan, May 2014.</li><li>Z. Qian, D.-C. Juan, P. Bogdan, C.-Y. Tsui, D. Marculescu, and R. Marculescu, “A Comprehensive and Accurate Latency Model for Network-on-Chip Performance Analysis,” in Proc. IEEE/ACM Asian-South Pacific Design Automation Conference (ASPDAC), Yokohama, Japan, Jan. 2014.</li><li>G. Liu, J. Park, and D. Marculescu, “Dynamic Thread Mapping for High-Performance, Power-Efficient Heterogeneous Manycore Systems,” in Proc. IEEE Intl. Conference on Computer Design (ICCD), Asheville, NC, Oct. 2013.</li><li>D.-C. Juan, S. Garg, J. Park, and D. Marculescu, “Learning the Optimal Operating Point for Many-Core Systems with Extended Range Voltage/Frequency Scaling,” in Proc. ACM/IEEE Intl. Conference on Hardware-Software Codesign and System Synthesis (CODES-ISSS), Montreal, Canada, Sept. 2013.</li><li>N. Miskov-Zivanov, D. Marculescu, and J.R. Faeder, “Dynamic behavior of cell signaling networks: model design and analysis automation,” in Proc. ACM/IEEE Design Automation Conference (DAC), Austin, TX, June 2013. (<b>Special session</b>)</li><li>Y. Turakhia, B. Raghunathan, S. Garg, and D. Marculescu, “HaDeS: Architectural Synthesis for Heterogeneous Dark Silicon Chip Multi-processors,” in Proc. ACM/IEEE Design Automation Conference (DAC), Austin, TX, June 2013.</li><li>A. Sharma, K. Neelathalli, D. Marculescu, and E. Nurvitadhi, “Hardware Efficient Stereo Estimation Using a Residual-Based Approach,” in Proc. IEEE Intl. Conference on Acoustics, Speech, and Signal Processing (ICASSP), Vancouver, Canada, May 2013.</li><li>D.-C. Juan, S. Garg, and D. Marculescu, “Impact of Manufacturing Process Variations on Performance and Thermal Characteristics of 3D ICs: Emerging Challenges and New Solutions,” in Proc. IEEE Intl. Symposium on Circuits and Systems (ISCAS), Beijing, China, May 2013. (<b>Invited paper</b>)</li><li>Z. Qian, D.-C. Juan, P. Bogdan, C.-Y. Tsui, D. Marculescu, and R. Marculescu, “SVR-NoC: A Performance Analysis Tool for Network-on-Chip Architectures Using Learning-based Support Vector Regression Model,” in Proc. IEEE/ACM Design, Automation, and Test in Europe Conference (DATE), Grenoble, France, March 2013.</li><li>Y. Turakhia, B. Raghunathan, S. Garg, and D. Marculescu, “Cherry-Picking: Exploiting Process Variations in Dark-Silicon Homogeneous Chip Multi-Processors,” in Proc. IEEE/ACM Design, Automation, and Test in Europe Conference (DATE), Grenoble, France, March 2013.</li><li>D.-C. Juan and D. Marculescu, “Power-aware Performance Increase via Core/Uncore Reinforcement Control for Chip-Multiprocessors,” in Proc. of ACM/IEEE Intl. Symposium on Low Power Electronics and Design (ISLPED), Los Angeles, CA, Jul. 2012.</li><li>K.-C. Wu, D. Marculescu, M.-C. Lee, and S.-C. Chang, “Mitigating Lifetime Underestimation: A System-Level Approach Considering Temperature Variations and Correlations between Failure Mechanisms,” in Proc. IEEE/ACM Design, Automation, and Test in Europe Conference (DATE), Dresden, Germany, March 2012.</li><li>D.-C. Juan, Y.-L. Chuang, D. Marculescu, and Y.-W. Chang, “Statistical Thermal Modeling and Mitigation Strategies Considering Leakage Power Variations,” in Proc. IEEE/ACM Design, Automation, and Test in Europe Conference (DATE), Dresden, Germany, March 2012.</li><li>M.-C. Lee, Y. Shi, Y.-G. Chen, D. Marculescu, and S.-C. Chang, “Efficient On-line Module-Level Wake-Up Scheduling for High Performance Multi-Module Designs,” in Proc. ACM/IEEE Intl. Symposium on Physical Design (ISPD), Napa, CA, March 2012.</li><li>D.-C. Juan, H. Zhou, D. Marculescu, and X. Li, “A Learning-Based Autoregressive Model for Fast Transient Thermal Analysis of Chip-Multiprocessors,” in Proc. IEEE/ACM Asian-South Pacific Design Automation Conference (ASPDAC), Sydney, Australia, Jan. 2012.</li><li>Y.-L. Chuang, T.-Y.  Ho, H.-T.  Lin, Y.-W. Chang, and D.  Marculescu, “PRICE: Power Reduction by Placement and Clock-Network Co-Synthesis for Pulsed-Latch Designs,” in Proc. of the IEEE/ACM Intl. Conference on Computer-Aided Design (ICCAD), San Jose, CA, Nov. 2011.</li><li>N. Miskov-Zivanov, A. Bresticker, S. Venkatakrishnan, P. Kashinkunti, D. Krishnaswamy, D. Marculescu, and J. Faeder, “Regulatory Network Analysis Acceleration with Reconfigurable Hardware,” in Proc. Annual International Conference of the IEEE Engineering in Medicine and Biology Society (EMBC), Boston, MA, Sept. 2011.</li><li>K.-C. Wu, D. Marculescu, M.-C. Lee, and S.-C. Chang, “Analysis and Mitigation of NBTI-Induced Performance Degradation for Power-Gated Circuits,” in Proc. of ACM/IEEE Intl. Symposium on Low Power Electronics and Design (ISLPED), Fukuoka, Japan, Aug. 2011.</li><li>N. Miskov-Zivanov, D. Krishnaswamy, S. Venkataraman, A. Bresticker, D. Marculescu, and J.R. Faeder, “Emulation of Biological Networks in Reconfigurable Hardware,” in Proc. ACM Intl. Conference on Bioinformatics and Computational Biology (BCB), Chicago, IL, Aug. 2011.</li><li>S. Garg and D. Marculescu, “Parametric Yield and Reliability of 3D Integrated Circuits: New Challenges and Solutions,” in Proc. IEEE VLSI Test Symposium (VTS), Dana Point, CA, May 2011. (<b>Invited paper</b>)</li><li>D.-C. Juan, S. Garg, and D. Marculescu, “Statistical Thermal Evaluation and Mitigation Techniques for 3D Chip-Multiprocessors In the Presence of Process Variations,” in Proc. of IEEE/ACM Design, Automation and Test in Europe (DATE), Grenoble, France, March 2011.</li><li>K.-C. Wu and D. Marculescu, “Aging-Aware Timing Analysis and Optimization Considering Path Sensitization,” in Proc. of IEEE/ACM Design, Automation and Test in Europe (DATE), Grenoble, France, March 2011.</li><li>S. Garg, D. Marculescu, and S. Herbert, “Process Variation Aware Performance Modeling and Dynamic Power Management for Multicore Systems,” in IEEE/ACM Intl. Conference on Computer-Aided Design (ICCAD), San Jose, CA, Nov. 2010. (Embedded tutorial)</li><li>S. Garg, D. Marculescu, and R. Marculescu, “Custom Feedback Control: Enabling Truly Scalable On-Chip Power Management for MPSoCs,” in Proc. ACM/IEEE Intl. Symposium on Low Power Electronics and Design (ISLPED), Austin, TX, Aug. 2010.</li><li>D. Marculescu and N. Miskov-Zivanov, “Formal Modeling and Reasoning for Reliability Analysis,” in Proc. of ACM/IEEE Design Automation Conference (DAC), Anaheim, CA, June 2010. (<b>Invited paper</b>)</li><li>S. Garg, R. Yan, R. Marculescu, D. Marculescu, and U. Schlichtmann, “Architectural Modeling of the Impact of Process Variations on Network-on-Chip Clock Frequency,” in Proc. Workshop on Diagnostic Services in Network-on-Chips (DSNOC), in conjunction with ACM/IEEE Design Automation Conference (DAC), Anaheim, CA, June 2010.</li><li>N. Miskov-Zivanov and D. Marculescu, “Modeling and Analysis of SER in Combinational Circuits,” in Proc. of IEEE Workshop on Silicon Errors in Logic – System Effects (SELSE), Stanford, CA, March 2010. (<b>Invited paper</b>)</li><li>K.-C. Wu and D. Marculescu, “Clock Skew Scheduling for Soft-Error-Tolerant Sequential Circuits,” in Proc. of IEEE/ACM Design, Automation and Test in Europe (DATE), Dresden, Germany, March 2010.</li><li>A. Bonnoit, S. Herbert, D. Marculescu, and L. Pileggi, “Integrating Dynamic Voltage/Frequency Scaling and Adaptive Body Biasing using Test-time Voltage Selection,” in Proc. of ACM/IEEE Intl. Symposium on Low Power Electronics and Design (ISLPED), San Francisco, CA, Aug. 2009.</li><li>S. Garg, D. Marculescu, R. Marculescu, and U. Ogras, “Technology-driven Limits on DVFS Controllability of Multiple Voltage-Frequency Island Designs,” in Proc. of IEEE/ACM Design Automation Conference (DAC), San Francisco, CA, Jul. 2009.</li><li>K.-C. Wu and D. Marculescu, “Joint Logic Restructuring and Pin Reordering for Mitigating NBTI-Induced Affects,” in Proc. of IEEE/ACM Design, Automation and Test in Europe (DATE), Nice, France, Apr. 2009.</li><li>S. Garg and D. Marculescu, “Process Variability Analysis and Mitigation for 3D MPSoCs,” in Proc. of IEEE/ACM Design, Automation and Test in Europe (DATE), Nice, France, Apr. 2009. (<b>Paper nominated for <b>Best Paper Award</b></b>)</li><li>S. Garg and D. Marculescu, “3D GCP - An Analytical Model for the Impact of Process Variations on the Critical Path Delay of 3D ICs,” in Proc. of IEEE International Symposium on Quality Electronic Design (ISQED), San Jose, CA, Mar. 2009. (<b>Best Paper Award</b>)</li><li>W.-P. Lee, Y.-W. Chang, and D. Marculescu , “Post-Floorplanning Power/Ground Ring Synthesis for Multiple-Supply-VoltageDesigns,” in Proc. of ACM International Symposium on Physical Design (ISPD), San Diego, CA, Mar. 2009.</li><li>S. Herbert and D. Marculescu, “Variation-Aware Dynamic Voltage/Frequency Scaling,” in Proc. of the 15th International Symposium on High-Performance Computer Architecture (HPCA), Raleigh, NC, Feb. 2009.</li><li>K.-C. Wu and D. Marculescu, “Power-Aware Soft Error Hardening via Selective Voltage Scaling,” in Proc. IEEE Intl. Conference on Computer Design (ICCD), Lake Tahoe, CA, Oct. 2008. (<b>Best Paper Award</b>)</li><li>N. Miskov-Zivanov, K.-C. Wu, and D. Marculescu, “Process Variability-Aware Transient Fault Modeling and Analysis,” in Proc. IEEE/ACM Intl. Conference on Computer Aided-Design (ICCAD), in San Jose, CA, Nov. 2008.</li><li>S. Garg and D. Marculescu, “System-Level Mitigation of WID Leakage Power Variability Using Body-Bias Islands,” in Proc. ACM/IEEE Intl. Conference on Hardware-Software Codesign and System Synthesis (CODES-ISSS), Atlanta, GA, Oct. 2008.</li><li>S. Herbert and D. Marculescu, “Analysis of Variability-Tolerance in Chip-Multiprocessors,” in Proc. ACM/IEEE Design Automation Conference (DAC), Anaheim, CA, June 2008. (<b>Paper nominated for <b>Best Paper Award</b></b>)</li><li>U.Y. Ogras, R. Marculescu, D. Marculescu, and E.-G. Jung, “Variation-Adaptive Feedback Control for Networks-on-Chip with Multiple Clock Domains,” in Proc. ACM/IEEE Design Automation Conference (DAC), Anaheim, CA, June 2008. (<b>Paper nominated for <b>Best Paper Award</b></b>)</li><li>N. Miskov-Zivanov and D. Marculescu, “A Systematic Approach to Modeling and Analysis of Transient Faults in Logic Circuits,” in Proc. IEEE Intl. Symposium on Quality on Electronic Design (ISQED), San Jose, CA, March 2008.</li><li>K.-C. Wu and D. Marculescu, “Soft Error Rate Reduction Using Redundancy Addition and Removal,” in Proc. IEEE/ACM Asian-South Pacific Design Automation Conference (ASPDAC), Seoul, Korea, Jan. 2008.</li><li>S. Garg and D. Marculescu, “On the Impact of Manufacturing Process Variations On the Lifetime of Sensor Networks,” in Proc. ACM/IEEE Intl. Conference on Hardware-Software Codesign and System Synthesis (CODES-ISSS), Salzburg, Austria, Sept. 2007.</li><li>S. Herbert and D. Marculescu, “Analysis of Dynamic Voltage/Frequency Scaling in Chip-Multiprocessors,” in Proc. ACM/IEEE Intl. Symposium on Low Power Electronics and Design (ISLPED), Portland, OR, Aug. 2007.</li><li>U.Y. Ogras, P .Choudhary, R. Marculescu, and D. Marculescu, “Voltage-Frequency Island Partitioning for GALS-Based Networks-on-Chip,” in Proc. ACM/IEEE Design Automation Conference (DAC), San Diego, CA, June 2007. (<b>Paper nominated for <b>Best Paper Award</b></b>)</li><li>S. Garg and D. Marculescu, “System-Level Process Variation Driven Throughput Analysis for Single and Multiple Voltage-Frequency Island Designs,” in Proc. IEEE Design, Automation and Test in Europe (DATE), Nice, France, Apr. 2007.</li><li>N. Miskov-Zivanov and D. Marculescu, “Soft Error Rate Analysis for Sequential Circuits,” in Proc. IEEE Design, Automation and Test in Europe (DATE), Nice, France, Apr. 2007.</li><li>P. Stanley-Marbell and D. Marculescu, “An 0.9 X 1.2”, Low Power, Energy-Harvesting System with Custom Multi-Channel Communication Interface,” in Proc. IEEE Design, Automation and Test in Europe (DATE), Nice, France, Apr. 2007.</li><li>N. Miskov-Zivanov and D. Marculescu, “MARS-S: Modeling, Analysis and Reduction of Soft Errors in Sequential Circuits,” in Proc. IEEE Intl. Symposium on Quality in Electronic Design (ISQED), San Jose, CA, March 2007. (<b>Paper nominated for <b>Best Paper Award</b></b>)</li><li>P. Stanley-Marbell and D. Marculescu, “Sunflower: Full-System Embedded Microarchitecture Evaluation,” in Proc. Intl. Conf. on High Performance Embedded Architectures & Compilers (HiPEAC), Ghent, Belgium, Jan. 2007.</li><li>D. Marculescu and S. Garg, “System-Level Process-Driven Variability Analysis for Single and Multiple Voltage-Frequency Island Systems,” in Proc. IEEE/ACM Intl. Conference on Computer Aided-Design (ICCAD), in San Jose, CA, Nov. 2006.</li><li>P. Choudhary and D. Marculescu, “Hardware based Frequency/Voltage Control of Voltage Frequency Island Systems,” in Proc. IEEE/ACM Intl. Conference on Hardware/Software Codesign and System Synthesis  (CODES-ISSS), Seoul, Korea, Oct. 2006.</li><li>N. Miskov-Zivanov and D. Marculescu, “MARS-C: Modeling, Analysis and Reduction of Soft Errors in Combinational Circuits,” in Proc. ACM/IEEE Design Automation Conference (DAC), San Francisco, CA, June 2006.</li><li>C.-H. Chang and D. Marculescu, “Design and Analysis of a Low Power VLIW DSP Core,” in Proc. IEEE Computer Society Annual Symposium on VLSI  (ISVLSI), Karlsruhe, Germany, March 2006.</li><li>K. Niyogi and D. Marculescu, “System Level Power and Performance Modeling of GALS Point-to-point Communication Interfaces,” in Proc. ACM/IEEE Intl. Symposium on Low Power Electronics and Design (ISLPED), San Diego, CA, Aug. 2005.</li><li>D. Marculescu and E. Talpes, “Variability and Energy Awareness: A Microarchitecture-Level Perspective,” in ACM/IEEE Design Automation Conference (DAC), Anaheim, CA, June 2005.</li><li>E. Talpes and D. Marculescu, “Increased Scalability and Power Efficiency through Multiple Speed Pipelines,” in Proc. ACM Intl. Symposium on Computer Architecture (ISCA), Madison, WI, June 2005.</li><li>D. Marculescu, “Energy Bounds for Fault-Tolerant Nanoscale Designs,” in Proc. IEEE Design, Automation and Test in Europe (DATE), Munich, Germany, March 2005. (<b>Paper nominated for <b>Best Paper Award</b></b>)</li><li>K. Niyogi and D. Marculescu, “Speed and Voltage Selection for GALS Systems Based on Voltage/Frequency Islands,” in IEEE/ACM Asian-South Pacific Design Automation Conference (ASPDAC), Shanghai, China, Jan. 2005. (<b>Best Paper Award</b>)</li><li>R. Marculescu, D. Marculescu, and L. Pileggi, “Toward an Integrated Design Methodology for Fault-Tolerant, Multiple Clock/Voltage Integrated Systems,” in Proc. IEEE Intl. Conference on Computer Design (ICCD), San Jose, CA, October 2004. (<b>Invited paper</b>)</li><li>D. Marculescu, “Application Adaptive Energy Efficient Clustered Architectures,” in Proc. ACM/IEEE Intl. Symposium on Low Power Electronics and Design (ISLPED), Newport Beach, CA, Aug. 2004.</li><li>E. Talpes and D. Marculescu, “Impact of Technology Scaling on Energy Aware Execution Cache-based Microarchitectures,” in Proc. ACM/IEEE Intl. Symposium on Low Power Electronics and Design (ISLPED), Newport Beach, CA, Aug. 2004.</li><li>P. Stanley-Marbell and D. Marculescu, “Local Decisions and Triggering Mechanisms for Adaptive Fault-Tolerance,” in Proc. IEEE Design, Automation and Test in Europe Conf. (DATE), Paris, France, Feb. 2004.</li><li>V.S.P. Rapaka, E. Talpes, and D. Marculescu, “Mixed-Clock Issue Queue Design for Energy Aware, High-Performance Cores,” in Proc. IEEE/ACM Asian-South Pacific Design Automation Conference (ASPDAC), Yokohama, Japan, Jan. 2004.</li><li>P. Stanley-Marbell and D. Marculescu, “Dynamic Fault­Tolerance and Metrics for Battery Powered, Failure­Prone Systems,” in Proc. IEEE/ACM Intl. Conference on Computer-Aided Design (ICCAD), San Jose, CA, Nov. 2003.</li><li>D. Marculescu, N. H. Zamora, P. Stanley-Marbell, and R. Marculescu, “Fault-Tolerant Techniques for Ambient Intelligent Distributed Systems,” in Proc. IEEE/ACM Intl. Conference on Computer-Aided Design (ICCAD), San Jose, CA, Nov. 2003.</li><li>V.S.P. Rapaka and D. Marculescu, “A Mixed-Clock Issue Queue Design for Globally Asynchronous, Locally Synchronous Processor Cores,” in Proc. ACM/IEEE Intl. Symposium on Low Power Electronics and Design (ISLPED), Seoul, Korea, Aug. 2003.</li><li>E. Talpes and D. Marculescu, “A Critical Analysis of Application-Adaptive Multiple Clock Processors,” in Proc. ACM/IEEE Intl. Symposium on Low Power Electronics and Design (ISLPED), Seoul, Korea, Aug. 2003.</li><li>M. Lindwer, D. Marculescu, T. Basten, R. Zimmermann, R. Marculescu, S. Jung, and E. Cantatore, “Ambient Intelligence Visions and Achievements: Linking Abstract Ideas to Real-World Concepts,” in IEEE Design, Automation and Test in Europe Conf. (DATE), Munich, Germany, March 2003. (Hot topic session)</li><li>V.S.P. Rapaka and D. Marculescu, “Pre-characterization Free Efficient Power/Performance Analysis of Embedded and General Purpose Software Applications,” in Proc. IEEE Design, Automation and Test in Europe Conf. (DATE), Munich, Germany, March 2003.</li><li>S.W. Haga, N. Reeves, R. Barua, and D. Marculescu, “Dynamic Functional Unit Assignment for Low Power,” in Proc. IEEE Design, Automation and Test in Europe Conf. (DATE), Munich, Germany, March 2003.</li><li>A. Iyer and D. Marculescu, “Power Efficiency of Voltage Scaling in Multiple Clock, Multiple Voltage Cores,” in Proc. IEEE/ACM Intl. Conference on Computer Aided Design (ICCAD), San Jose, CA, Nov. 2002.</li><li>D. Marculescu, R. Marculescu, and P. Khosla, “Challenges and Opportunities in E-textile Analysis, Modeling and Optimization,” in Proc. ACM/IEEE Design Automation Conference (DAC), Anaheim, CA, June 2002. (<b>Special session</b>)</li><li>A. Iyer and D. Marculescu, “Power Performance Evaluation of Globally Asynchronous, Locally Synchronous Processors,” in Proc. IEEE Intl. Symposium on Computer Architecture (ISCA), Anchorage, AK, May 2002.</li><li>R. Marculescu and D. Marculescu, “Is Q=MC2? (On the Relationship between the Model of Colloidal Computing and Quality in Electronic Design),” in Proc. ACM Intl. Symposium on Quality in Electronic Design (ISQED), March 2002. (<b>Invited paper</b>)</li><li>D. Marculescu and A. Iyer, “Application-Driven Processor Design Exploration for Power-Performance Trade-off Analysis,” in Proc. IEEE/ACM Intl. Conference on Computer Aided Design (ICCAD), November 2001.</li><li>E. Talpes and D. Marculescu, “Power Reduction through Work Reuse,” in Proc. ACM Intl. Symposium on Low Power Electronics and Design (ISLPED), August 2001.</li><li>A. Iyer and D. Marculescu, “Power Aware Microarchitecture Resource Scaling,” in Proc. of IEEE Design, Auto¬mation and Test in Europe Conf. (DATE), Munich, Germany, March 2001.</li><li>D. Marculescu, “Profile-Driven Code Execution for Low Power Dissipation,” in Proc. ACM Intl. Symp. on Low Power Electronics and Design (ISLPED), Rapallo/Portofino Coast, Italy, July 2000.</li><li>D. Marculescu and R. Marculescu, “Information-Theoretic Bounds for Switching Activity Analysis in Finite-State Machines under Temporally Correlated Inputs,” in Proc. 33rd Asilomar Conference on Signals, Systems, and Com¬puters (ASILOMAR), October 1999. (<b>Invited paper</b>)</li><li>R. Marculescu, D. Marculescu, and M. Pedram, “Non-Stationary Effects in Trace-Driven Power Analysis,” in Proc. ACM Intl. Symp. on Low Power Electronics and Design (ISLPED), San Diego, CA, August 1999.</li><li>D. Marculescu, R. Marculescu, and M. Pedram, “Theoretical Bounds for Switching Activity Analysis in Finite-State Machines,” in Proc. ACM Intl. Symp. on Low Power Electronics and Design (ISLPED), Monterey, CA, August 1998.</li><li>D. Marculescu, R. Marculescu, and M. Pedram, “Trace-Driven Steady-State Probability Estimation in FSMs with Application to Power Estimation,” in Proc. ACM Design, Automation and Test in Europe Conf. (DATE), Paris, France, February 1998.</li><li>R Marculescu, D. Marculescu, and M. Pedram, “Block Entropy and High-Order Temporal Effects in Composite Sequence Compaction for Finite-State Machines,” in Proc. ACM Intl. Symp. on Low Power Electronics and Design (ISLPED), Monterey, CA, August 1997.</li><li>R. Marculescu, D. Marculescu, and M. Pedram, “Hierarchical Sequence Compaction for Power Estimation,” in Proc. ACM/IEEE Design Automation Conf. (DAC), Anaheim, CA, June 1997.  (<b>Paper nominated for <b>Best Paper Award</b></b>)</li><li>D. Marculescu, R. Marculescu, and M. Pedram, “Sequence Compaction for Probabilistic Analysis of Finite-State Machines,” in Proc. ACM/IEEE Design Automation Conf. (DAC), Anaheim, CA, June 1997.</li><li>R. Marculescu, D. Marculescu, and M. Pedram, “Adaptive Models for Input Data Compaction for Power Simulators,” in Proc. ACM Asia and South-Pacific Design Automation Conf. (ASPDAC), Japan, January 1997.</li><li>D. Marculescu, R. Marculescu, and M. Pedram, “Stochastic Sequential Machine Synthesis Targeting Constrained Sequence Generation,” in Proc. ACM/IEEE Design Automation Conf. (DAC), Las Vegas, NV, June 1996. (Paper Nominated for <b>Best Paper Award</b>)</li><li>C.-Y.Tsui, R. Marculescu, D. Marculescu, and M. Pedram, “Reducing the Run-Time of Simulation-Based Power Estimation by Vector Compaction,” in Proc. ACM/IEEE Design Automation Conf. (DAC), Las Vegas, NV, June 1996.</li><li>D. Marculescu, R. Marculescu, and M. Pedram, “Information Theoretic Measures for Energy Consumption at Register Transfer Level,” in Proc. ACM Intl. Symposium. on Low Power Design (ISLPED), Dana Point, CA, April 1995.</li><li>R. Marculescu, D. Marculescu, and M. Pedram, “Efficient Power Estimation for Highly Correlated Input Streams,” in Proc. of ACM/IEEE Design Automation Conf. (DAC), San Francisco, CA, June 1995.</li><li>R. Marculescu, D. Marculescu, and M. Pedram, “Switching Activity Analysis Considering Spatiotemporal Correlations,” in Proc. IEEE/ACM Intl. Conf. on Computer Aided Design (ICCAD), San Jose, CA, November 1994.</li></ol>"
}